const mcqs = [
    {
        question: "রবীন্দ্রনাথ ঠাকুর কত সালে জন্মগ্রহণ করেন?",
        options: ["১৮৬১", "১৮৬২", "১৮৬৩", "১৮৬৪"],
        answer: 0 // Correct answer is option "ঘ. ১৮৬৪"
    },
        {
            question: "বাংলা সাহিত্যের প্রথম সার্থক ছোটগল্প রচয়িতা কে?",
            options: ["প্রমথ চৌধুরী", "বঙ্কিমচন্দ্র চট্টোপাধ্যায়", "রবীন্দ্রনাথ ঠাকুর", "শরৎচন্দ্র চট্টোপাধ্যায়"],
            answer: 2 // Correct answer is option "গ. রবীন্দ্রনাথ ঠাকুর"
        },
        {
            question: "রবীন্দ্রনাথ ঠাকুর কোন অভিধায় সম্ভাষিত?",
            options: ["বিশ্বকবি", "চারণ কবি", "জাতীয় কবি", "নাগরিক কবি"],
            answer: 0 // Correct answer is option "ক. বিশ্বকবি"
        },
        {
            question: "‘গল্পগুচ্ছে’ কতটি গল্প সংকলিত হয়েছে?",
            options: ["৯১", "৯২", "৯৪", "৯৫"],
            answer: 3 // Correct answer is option "ঘ. ৯৫"
        },
        {
            question: "রবীন্দ্রনাথ ঠাকুর কুষ্টিয়ার শিলাইদহে বসবাস করেছিলেন কেন?",
            options: ["সাহিত্য সাধনার জন্য", "জমিদারি দেখাশোনার জন্য", "প্রকৃতির কাছে থাকার জন্য", "মানুষের কাছাকাছি থাকার জন্য"],
            answer: 1 // Correct answer is option "খ. জমিদারি দেখাশোনার জন্য"
        },
        {
            question: "কোথায় বসবাসের কাল রবীন্দ্রনাথের ছোটগল্প রচনার স্বর্ণযুগ?",
            options: ["শান্তিনিকেতন", "জোড়াসাঁকো", "শাহজাদপুর", "শিলাইদহ"],
            answer: 3 // Correct answer is option "ঘ. শিলাইদহ"
        },

            {
                question: "‘কাজী নজরুল ইসলাম ছোটগল্পের পাশাপাশি উপন্যাসও লিখেছেন।’ কাজী নজরুল ইসলামের সাথে কার সাদৃশ্য রয়েছে?",
                options: ["রবীন্দ্রনাথ ঠাকুর", "শামসুর রাহমান", "প্রমথ চৌধুরী", "বুদ্ধদেব বসু"],
                answer: 1 // Correct answer is option "খ. শামসুর রাহমান"
            },
            {
                question: "রবীন্দ্রনাথ ঠাকুর বিশ শতকে যেসব ছোটগল্প লিখেছেন সেখানে কী প্রাধান্য পেয়েছে?",
                options: ["প্রকৃতি", "ভাবকল্পনা", "বিরহ", "বাস্তবতা"],
                answer: 3 // Correct answer is option "ঘ. বাস্তবতা"
            },
            {
                question: "‘শেষের কবিতা’ কী?",
                options: ["কবিতা", "ছোটগল্প", "নাটক", "উপন্যাস"],
                answer: 3 // Correct answer is option "ঘ. উপন্যাস"
            },
            {
                question: "রবীন্দ্রনাথ ঠাকুর কত সালে মৃত্যুবরণ করেন?",
                options: ["১৯৪০", "১৯৪১", "১৯৪৩", "১৯৪৫"],
                answer: 1 // Correct answer is option "খ. ১৯৪১"
            },
            {
                question: "অনুপম কার হাতে মানুষ?",
                options: ["মা’র", "বাবার", "মামার", "ধাত্রীর"],
                answer: 0 // Correct answer is option "ক. মা’র"
            },
            {
                question: "অনুপমের মা কেমন ঘরের মেয়ে?",
                options: ["বামুনের", "গরিবের", "কায়েতের", "ধনীর"],
                answer: 1 // Correct answer is option "খ. গরিবের"
            },

                
                {
                    question: "কাকে দেখলে অনড়বপূর্ণার কোলে গজাননের ছোট ভাই বলে মনে হবে?",
                    options: ["কার্তিক", "অনুপমকে", "হরিশ", "মামা"],
                    answer: 1
                },
                {
                    question: "অনুপমের থেকে তার মামা বড়জোর কত বছরের বড়?",
                    options: ["দুই", "তিন", "চার", "ছয়"],
                    answer: 3
                },
                {
                    question: "কন্যার পিতামাত্রেই কী স্বীকার করবেন?",
                    options: ["গল্পকথক খুবই সুদর্শন", "গল্পকথক খুবই বিনয়ী", "গল্পকথক একজন সুনাগরিক", "গল্পকথক একজন সৎপাত্র"],
                    answer: 3
                },
                {
                    question: "অনুপম নিতান্তই ভালো মানুষ কেন?",
                    options: ["ধূমপানের অভ্যাস না থাকায়", "ভালো মানুষ হওয়ার কোনো ঝঞ্ঝাট নাই বলে", "মন্দলোকদের সাথে না মেশায়", "ভালো বংশে জন্মগ্রহণ করায়"],
                    answer: 1
                },
                {
                    question: "কেমন ঘর থেকে অনুপমের সম্বন্ধ এসেছিল?",
                    options: ["খান্দানি ঘর", "বনেদি ঘর", "অনেক বড় ঘর", "অনেক ছোট ঘর"],
                    answer: 2
                },
                {
                    question: "‘অপরিচিতা’ গল্পে উল্লেখকৃত বিবাহ সম্বন্ধে কার একটা বিশেষ মত ছিল?",
                    options: ["অনুপমের", "মা’র", "মামার", "কল্যাণীর"],
                    answer: 2
                },
                {
                    question: "অনুপমের বন্ধুর নাম কী?",
                    options: ["হিরণ", "হরিশ", "নরেশ", "পরেশ"],
                    answer: 1
                },
                {
                    question: "হরিশ কোথায় কাজ করে?",
                    options: ["মালদহে", "বীরভূমে", "কানপুরে", "ভুজপুরে"],
                    answer: 2
                },
                {
                    question: "হরিশ ছুটিতে কোথায় এসেছিল?",
                    options: ["মালদহে", "কানপুরে", "আসানসোলে", "কলিকাতায়"],
                    answer: 3
                },
                {
                    question: "অনুপমের ‘মন উতলা’ বলতে কী বুঝানো হয়েছে?",
                    options: ["উদ্বেগ", "উৎকণ্ঠা", "শঙ্কা", "আকুলতা"],
                    answer: 3
                },
                {
                    question: "‘অপরিচিতা’ গল্পে অনুপম ‘এই অবকাশ’ বলতে কোন সময়ে বোঝানো হয়েছে?",
                    options: ["এম. এ. পাসের পরের সময়", "কলেজের ছুটির সময়", "বিয়ের সিদ্ধান্ত হওয়ার পরের সময়", "বিয়ের আয়োজনের পূর্বের সময়"],
                    answer: 0
                },
                {
                    question: "কোন বাতাসে অনুপমের শরীর মন কাঁপতে লাগল?",
                    options: ["গ্রীষ্মের", "বর্ষার", "শীতের", "বসন্তের"],
                    answer: 3
                },
                {
                    question: "হরিশ কোন বিষয়ে অদ্বিতীয় ছিল?",
                    options: [" ঘটকালিতে", " তাস পেটাতে", " আসর জমাতে", " গুল মারতে"],
                    answer: 2
                },
                {
                    question: " কার মন ছিল তৃষার্ত?",
                    options: [" হরিশের", "অনুপমের", "মামার", "মা’র"],
                    answer: 1
                },
                {
                    question: "মামা কাকে পেলে ছাড়তে চান না?",
                    options: [" অনুপমকে", "হরিশকে", "কল্যাণীকে", "কল্যাণীর বাবাকে"],
                    answer: 3
                },
                {
                    question: " কথাটা কার বৈঠকে উঠল?",
                    options: [" বাবার", "মা’র", "হরিশের", "মামার"],
                    answer: 3
                },
                {
                    question: " মামার কাছে মেয়ের চেয়ে মেয়ের বাপের দেশত্যাগ করে পশ্চিমে গিয়ে বাস করার কারণ কী?",
                    options: [" গুরুতর", "গুরুত্বপূর্ণ", "জরুরি", "সাংঘাতিক"],
                    answer: 0
                },
                {
                    question: " ‘অপরিচিতা’ গল্পে উল্লেখকৃত কার পেছনে মেয়ের বাপের লক্ষীর ঘটটি উপুড় করে দিতে দ্বিধা হবে না?",
                    options: [" দেশে সুন্দরী কন্যা নিয়ে বাস করা দায়", "আর্থিক দৈন্যে দেশে সমাজ রক্ষা করে চলা দায়", "পশ্চিমে বেশিরভাগ পুণ্যভূমি অবস্থিত", "মেয়ের বয়স বেশি হয়ে যাওয়ায়"],
                    answer: 3
                },
                {
                    question: " পশ্চিমে মেয়ের বাবা কী অবস্থায় থাকেন?",
                    options: [" রাজার হালে", "জমিদারের মতো", "প্রজার মতো", "গরিব গৃহস্থের মতো"],
                    answer: 3
                },
                {
                    question: " ‘অপরিচিতা’ গল্পে উল্লেখকৃত কার পেছনে মেয়ের বাপের লক্ষীর ঘটটি উপুড় করে দিতে দ্বিধা হবে না?",
                    options: [" জামাইয়ের", "মেয়ের", "অনুপমের", "মেয়ের শাশুড়ির"],
                    answer: 3
                },
                {
                    question: "বরের হাট মহার্ঘ কেন?",
                    options: [" যোগ্য বরের অভাবে", "যৌতুকের কারণে", "স্থান-কাল-পাত্রের বাছবিচারে", "মেয়ের বয়সের কারণে"],
                    answer: 1
                },
                {
                    question: "অনুপমের মামার মন নরম হলো কেন?",
                    options: [" মেয়ের রূপ সৌন্দর্যে", "মেয়ের বংশের কৌলিন্যে", "মেয়ের বাবার আতিথেয়তায়", "মেয়ের বাবার অর্থের লোভে"],
                    answer: 3
                },
                {
                    question: " ‘অপরিচিতা’ গল্পে ‘বিবাহের ভূমিকা-অংশটা’ বলতে কী বোঝানো হয়েছে?",
                    options: [" মেয়ের রূপ সৌন্দর্যে", "মেয়ের বংশের কৌলিন্যে", "মেয়ের বাবার আতিথেয়তায়", "মেয়ের বাবার অর্থের লোভে"],
                    answer: 0
                },
                {
                    question: "কলিকাতার বাইরে বাকি পৃথিবীটাকে মামা কিসের অন্তর্গত বলে মনে করেন?",
                    options: [" আন্দামান দ্বীপ", "লঙ্কা দ্বীপ", "সুবর্ণদ্বীপ", "নিঝুম দ্বীপ"],
                    answer: 0
                },

                {
                    question: " ‘অপরিচিতা’ গল্পের কথকের মনের মধ্যে কী ইচ্ছা ছিল?",
                    options: ["কানপুরে যাওয়ার ", "কোনড়বগর ঘুরে আসার", "যৌতুক ছাড়াই বিয়ে করার", " লুকিয়ে বিয়ে করার"],
                    answer: 2
                },

                    {
                      question: "অনুপমের নিজের চোখে মেয়ে দেখা হলো না কেন?",
                      options: ["বিষয়টি আপত্তিকর বলে", "কুলীন বংশে এটি চলে না", "মামার এতে ঘোরতর আপত্তি ছিল", "সাহস করে প্রস্তাব করতে না পারায়"],
                      answer: 3
                    },
                    {
                      question: "বিনুদাদা ফিরে এসে মেয়ে সম্পর্কে কী বললেন?",
                      options: ["মেয়ে চমৎকার সুন্দরী", "মেয়েটা খুবই মিষ্টি", "খাঁটি সোনা বটে", "হীরের টুকরো একটা"],
                      answer: 2
                    },
                    {
                      question: "বিনুদার ভাষাটা কেমন?",
                      options: ["বড় নীরস", "অত্যন্ত আঁট", "নিতান্ত সাদামাটা", "চলনসই"],
                      answer: 1
                    },
                    {
                      question: "বিয়ে উপলক্ষে কন্যাপক্ষকে কোথায় আসতে হলো?",
                      options: ["কলকাতায়", "কানপুরে", "বোলপুরে", "শিয়ালদহে"],
                      answer: 0
                    },
                    {
                      question: "অপরিচিতা’ গল্পের কন্যার পিতার নাম কী?",
                      options: ["বিশ্বনাথ ঘোষ", "শম্ভুনাথ সেন", "আদ্যিনাথ বৈদ্য", "বিশ্বম্ভর দাস"],
                      answer: 1
                    },
                    {
                      question: "বিয়ের কত দিন পূর্বে কন্যার পিতা পাত্রকে দেখেন?",
                      options: ["এক দিন", "দুই দিন", "তিন দিন", "চার দিন"],
                      answer: 2
                    },
                    {
                      question: "অপরিচিতা’ গল্পের কন্যার পিতার বয়স কত?",
                      options: ["চল্লিশের কিছু এপারে বা ওপারে", "পয়তাল্লিশের কিছু এপারে বা ওপারে", "পঞ্চাশের কিছু এপারে বা ওপারে", "পঞ্চানড়বর কিছু এপারে বা ওপারে"],
                      answer: 0
                    },
                    {
                      question: "পাত্র দেখে কন্যার বাপ খুশি কিনা তা বোঝা শক্ত ছিল। কারণ-",
                      options: ["তিনি ছিলেন খুবই অন্যমনস্ক", "তিনি ছিলেন খুবই চুপচাপ", "তিনি ছিলেন খুবই চাপা স্বভাবের", "তিনি ছিলেন খুবই গম্ভীর"],
                      answer: 1
                    },
                    {
                      question: "কী কারণে মামার মুখ অনর্গল ছুটিতেছিল?",
                      options: ["অভ্যাসবশে", "মুদ্রাদোষে", "ধন-মানের বাগাড়ম্বরে", "যৌতুকের লোভে"],
                      answer: 2
                    },
                    {
                      question: "শম্ভুনাথ বাবু কোন প্রসঙ্গের আলোচনায় একেবারেই যোগ দিলেন না?",
                      options: ["যৌতুকের", "কৌলিন্যের", "ভাল-মন্দের", "ধন-মানের"],
                      answer: 3
                    },
                    {
                      question: "“শম্ভুনাথ বাবু যখন উঠিলেন তখন মামা সংক্ষেপে উপর হইতেই তাঁকে বিদায় করিলেন।” -এই ঘটনার মাধ্যমে নিচের কোন বিষয়টি ফুটে উঠেছে?",
                      options: ["মামার বড়লোকি", "পাত্রপক্ষের আভিজাত্য", "পাত্রপক্ষের প্রতি অবজ্ঞা", "সৌজন্যতাবোধের অভাব"],
                      answer: 0
                    },
                    {
                      question: "অপরিচিতা’ গল্পে ‘পণ’ বলতে কী বোঝানো হয়েছিল?",
                      options: ["অঙ্গীকার", "সংকল্প", "শর্ত", "প্রতিজ্ঞা"],
                      answer: 3
                    },
                    {
                      question: "পণ সম্বন্ধে দুই পক্ষে কেমন কথা ঠিক হয়েছিল?",
                      options: ["পাকাপাকি", "বাঁধাধরা", "কড়াকড়ি", "মোটামুটি"],
                      answer: 0
                    }


    ];
