

const questions = [
    {
        question: " \"ওপরের হাত সবসময় নিচের হাত থেকে শ্রেষ্ঠ \"- এ কথাটি কে বলেছেন?",
        options: ["একজন দার্শনিক", "গৌতম বুদ্ধ", "ইসলামের নবি", "একজন সমাজসেবক"],
        answer: 2
    },
    {
        question: " উদ্দীপকটি পড়ে ২ ও ৩ নম্বর প্রশ্নের উত্তর দাও: <br> শহরের বুকে জলপাই রঙের ট্যাঙ্ক এলো দানবের মতো চিৎকার করতে করতে। <br> উদ্দীপকের সঙ্গে 'রেইনকোট' গল্পের সাদৃশ্যপূর্ণ বিষয়টি - <br> i. গ্রেনেড ছোড়া \&nbsp ii. মুক্তিযুদ্ধের সময়  iii. সালাম ও বরকত শহিদ হওয়া <br> নিচের কোনটি সঠিক ? ",
        options: ["i ও ii", " i ও iii", "ii ও iii", "i, ii ও iii"],
        answer: 3
    },
    {
        question: "উদ্দীপকের কোন বিষয়টিতে 'রেইনকোট' গল্পের মিল পাওয়া যায়?",
        options: ["ক্রাক-ডাউন রাতে ট্যাঙ্কের হুঙ্কার", "মানুষ মেরে ফেলা", "বাড়িঘর জ্বালিয়ে দেওয়া", "মুক্তিযোদ্ধাদের গেরিলা যুদ্ধ"],
        answer: 0
    },
    {
        question: "‘মানবিক বৃত্তি’ বলতে আমরা বুঝি-",
        options: ["মানবতা", "দয়া", "সেবা", "i, ii ও iii"],
        answer: 3
    },
    {
        question: "উদ্দীপকের ভাব 'প্রতিদান' কবিতার কোন ভাবটিকে ধারণ করে?",
        options: ["প্রতিবাদ", "হিংসা-বিদ্বেষপূর্ণ মনোভাব", "জাগরণ চিন্তা", "সাম্যবাদ"],
        answer: 3
    },
    {
        question: "উদ্দীপক ও আলোচ্য কবিতায় প্রকাশ পেয়েছে-",
        options: ["মানুষের প্রতি ভালোবাসা", "মানুষের প্রতি অবহেলা", "মানুষের শ্রেষ্ঠত্ব", "i, ii ও iii"],
        answer: 3
    }
    
    
    
    
    ];